import React from 'react';
import { ListItem, ListText, Title } from './DeliveryAndPayment.styled';
import { TbTruckDelivery } from 'react-icons/tb';
import { MdPayment } from 'react-icons/md';

export const DeliveryAndPayment = () => {
  return (
    <>
      <div>
        <Title>Доставка і оплата</Title>
        <ListText>
          <ListItem>
            <TbTruckDelivery />
            <h3>Умови доставки: </h3>
            <ul>
              <li>
                <h4>Доставка по Україні</h4>
                <p>
                  Доставка по Україні здійснюється кур'єрськими службами: Нова пошта та Укрпошта. Можлива доставка
                  післяплатою на відділення кур'єрської служби (Нова пошта) або Укрпошта. Вартість доставки залежить від
                  ваги та розмірів товару та розраховується за тарифами перевізника. Термін доставки: 1-3 дні. Послуги
                  доставки оплачує покупець.
                </p>
              </li>
              <li>
                <h4>Самовивіз</h4>
                <p>
                  Також Ви можете самостійно забрати замовлений товар у точці видачі, попередньо погодивши цей момент з
                  менеджером – контакти.
                </p>
              </li>
            </ul>
          </ListItem>
          <ListItem>
            <MdPayment />
            <h3>Способи оплати: </h3>
            <ul>
              <li>
                <h4>Оплата готівкою</h4>
                <p>
                  Сплатити цим способом можна при отриманні товару у кур'єра, на відділенні кур'єрської служби або
                  безпосередньо в офісах інтернет-магазину VicTar. Оплата готівкою здійснюється виключно у національній
                  валюті - українській гривні. Послугу з переказу грошей (накладений платіж) оплачує покупець.
                </p>
              </li>
              <li>
                <h4>Оплата по перерахунку</h4>
                <p>
                  Можлива оплата з Б/Г за рахунком-фактурою БЕЗ ПДВ (ФОП 2 Група). Або перерахунок на «карту ключ ФОП»
                </p>
              </li>
            </ul>
          </ListItem>
        </ListText>
      </div>
    </>
  );
};
