import React from 'react';
import { ListText, Container } from './AboutUs.styled';

export const AboutUs = () => {
  return (
    <Container>
      <h2>ПРО НАС</h2>
      <ListText>
        <li>
          <p>
            Наш інтернет магазин був заснований у 2016 році. За цей короткий період ми змогли зарекомендувати себе як
            магазин з високою якістю обслуговування, максимальною оперативністю виконання ваших замовлень та
            професіоналізмом роботи наших менеджерів.
          </p>
        </li>
        <li>
          <p>
            Ми прагнемо бути найкращими щодня, тому намагаємося по-максимуму полегшити покупцям пошук потрібного товару,
            за допомогою сучасного дизайну та зрозумілого оформлення сторінок.
          </p>
        </li>
      </ListText>
      <h3>Чому клієнти обирають нас?</h3>
      <ListText>
        <li>
          <p>- у нас одні із найнижчих цін в Україні;</p>
        </li>
        <li>
          <p>- весь товар що є в наявності завезений нами із закордону та зберігається на нашому складі;</p>
        </li>
        <li>
          <p>- для постійних покупців ми надаємо спеціальні ціни;</p>
        </li>
        <li>
          <p>- на всі товари ми надаємо гарантію;</p>
        </li>
        <li>
          <p>- оплата товару можлива різними варіантами, як по передоплаті, так і за фактом доставки;</p>
        </li>
        <li>
          <p>- ми завжди йдемо назустріч клієнту під час вирішення будь-яких спірних питань;</p>
        </li>
        <li>
          <p>- з нами Ви заощаджуєте час, роблячи покупки не виходячи з дому;</p>
        </li>
        <li>
          <p>- ми завжди ретельно обираємо своїх постачальників, щоб гарантувати отримання якісного товару.</p>
        </li>
      </ListText>
    </Container>
  );
};
